burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_spi.c
#ifdef FW_DEBUG_ERR_REPORT
    if(0U == i2s_audiosample) {
        fw_debug_report_err(SPI_I2S_MODULE_ID, API_ID(0x0007U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* deinit SPI_I2SPSC register */
        SPI_I2SPSC(spi_periph) = SPI_I2SPSC_DEFAULT_VALUE;

        if(0U == ((RCU_ADDCTL & I2S1_CLOCK_SEL) >> 12)){
            /* get the I2S1 source clock prescaler */
            pll2psc = (uint32_t)((RCU_PLLCFG & PLL2_I2S_PSC_MASK) >> 16U);
            /* get RCU PLL2 clock multiplication factor */
            pll2n = (uint32_t)((RCU_PLLCFG & PLL2_I2S_MUL_MASK) >> 8U);
            /* get RCU PLL2 clock division */
            pll2div = (uint32_t)((RCU_PLLCFG & PLL2_I2S_DIV_MASK));
     
            if(pll2n < 8U){
                /* multiplier is between 8 and 127 */
                pll2n = 8U;
            }
            /* calculate PLL2 clock */
            pll2clks = (uint32_t)((((HXTAL_VALUE / (pll2psc + 1U)) * pll2n) / pll2div) * 2U);
            /* get the I2S1 clock */
            i2sclock = pll2clks;
        }else if(2U == ((RCU_ADDCTL & I2S1_CLOCK_SEL) >> 12U)){
            /* get system clock */
            sysclock = rcu_clock_freq_get(CK_SYS);
            pllp = (GET_BITS(RCU_PLL, 16U, 17U) + 1U) * 2U;
            /* get RCU PLL I2S1 clock division */
            pllfdiv = (uint32_t)((RCU_ADDCTL & PLL_I2S_DIV_MASK) >> 24U);
            /* get the I2S1 clock */
            i2sclock = (uint32_t)((sysclock * pllp) / (pllfdiv + 1U));
        }else{
            SPI_ERROR_HANDLE(" i2s use external clock \r\n");
        }
        
        /* config the prescaler depending on the mclk output state, the frame format and audio sample rate */
        if(I2S_MCKOUT_ENABLE == i2s_mckout){
            clks = (uint32_t)(((i2sclock / 256U) * 10U) / i2s_audiosample);
        }else{
            if(I2S_FRAMEFORMAT_DT16B_CH16B == i2s_frameformat){
                clks = (uint32_t)(((i2sclock / 32U) *10U ) / i2s_audiosample);
            }else{
                clks = (uint32_t)(((i2sclock / 64U) *10U ) / i2s_audiosample);
            }
        }
        
        /* remove the floating point */
        clks     = (clks + 5U) / 10U;
        i2sof  = (clks & 0x00000001U);
        i2sdiv = ((clks - i2sof) / 2U);
        i2sof  = (i2sof << 8U);

        /* set the default values */
        if((i2sdiv < 2U) || (i2sdiv > 255U)){
            i2sdiv = 2U;
            i2sof = 0U;
        }

        /* configure SPI_I2SPSC */
        SPI_I2SPSC(spi_periph) = (uint32_t)((i2sdiv & SPI_I2SPSC_DIV) | (i2sof & SPI_I2SPSC_OF) | (i2s_mckout & SPI_I2SPSC_MCKOEN));

        /* clear SPI_I2SCTL_DTLEN and SPI_I2SCTL_CHLEN bits */
        SPI_I2SCTL(spi_periph) &= (uint32_t)(~(SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN));
        /* configure data frame format */
        SPI_I2SCTL(spi_periph) |= (uint32_t)(i2s_frameformat & (SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN));
    }
}

/*!
    \brief      configure I2S input clock prescaler (API_ID(0x0008))
    \param[in]  input_clock: I2S1 external input clock frequency
    \param[in]  i2s_audiosample: I2S audio sample rate
                only one parameter can be selected which is shown as below:
      \arg        I2S_AUDIOSAMPLE_8K: audio sample rate is 8KHz
      \arg        I2S_AUDIOSAMPLE_11K: audio sample rate is 11KHz
      \arg        I2S_AUDIOSAMPLE_16K: audio sample rate is 16KHz
      \arg        I2S_AUDIOSAMPLE_22K: audio sample rate is 22KHz
      \arg        I2S_AUDIOSAMPLE_32K: audio sample rate is 32KHz
      \arg        I2S_AUDIOSAMPLE_44K: audio sample rate is 44KHz
      \arg        I2S_AUDIOSAMPLE_48K: audio sample rate is 48KHz
      \arg        I2S_AUDIOSAMPLE_96K: audio sample rate is 96KHz
      \arg        I2S_AUDIOSAMPLE_192K: audio sample rate is 192KHz
    \param[in]  i2s_frameformat: I2S data length and channel length
                only one parameter can be selected which is shown as below:
      \arg        I2S_FRAMEFORMAT_DT16B_CH16B: I2S data length is 16 bit and channel length is 16 bit
      \arg        I2S_FRAMEFORMAT_DT16B_CH32B: I2S data length is 16 bit and channel length is 32 bit
      \arg        I2S_FRAMEFORMAT_DT24B_CH32B: I2S data length is 24 bit and channel length is 32 bit
      \arg        I2S_FRAMEFORMAT_DT32B_CH32B: I2S data length is 32 bit and channel length is 32 bit
    \param[in]  i2s_mckout: I2S master clock output
                only one parameter can be selected which is shown as below:
      \arg        I2S_MCKOUT_ENABLE: I2S master clock output enable
      \arg        I2S_MCKOUT_DISABLE: I2S master clock output disable
    \param[out] none
    \retval     none
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
void i2s_ckin_psc_config(uint32_t input_clock, uint32_t i2s_audiosample, uint32_t i2s_frameformat, uint32_t i2s_mckout)
{
    uint32_t i2sdiv = 2U, i2sof = 0U, clks = 0U, i2sclock = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(0U == i2s_audiosample) {
        fw_debug_report_err(SPI_I2S_MODULE_ID, API_ID(0x0008U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
         /* judge whether the audiosample is 0 */
        if(0U == i2s_audiosample){
            SPI_ERROR_HANDLE("the parameter can not be 0 \r\n");
        }

        /* deinit SPI_I2SPSC register */
        SPI_I2SPSC(SPI1) = SPI_I2SPSC_DEFAULT_VALUE;

        if(1U == ((RCU_ADDCTL & I2S1_CLOCK_SEL) >> 12)){
            /* get the I2S1 clock */
            i2sclock = input_clock;
        }else{
            SPI_ERROR_HANDLE(" i2s use internal clock \r\n");
        }
        
        /* config the prescaler depending on the mclk output state, the frame format and audio sample rate */
        if(I2S_MCKOUT_ENABLE == i2s_mckout){
            clks = (uint32_t)(((i2sclock / 256U) * 10U) / i2s_audiosample);
        }else{
            if(I2S_FRAMEFORMAT_DT16B_CH16B == i2s_frameformat){
                clks = (uint32_t)(((i2sclock / 32U) *10U ) / i2s_audiosample);
            }else{
                clks = (uint32_t)(((i2sclock / 64U) *10U ) / i2s_audiosample);
            }
        }
        
        /* remove the floating point */
        clks     = (clks + 5U) / 10U;
        i2sof  = (clks & 0x00000001U);
        i2sdiv = ((clks - i2sof) / 2U);
        i2sof  = (i2sof << 8U);

        /* set the default values */
        if((i2sdiv < 2U) || (i2sdiv > 255U)){
            i2sdiv = 2U;
            i2sof = 0U;
        }

        /* configure SPI_I2SPSC */
        SPI_I2SPSC(SPI1) = (uint32_t)((i2sdiv & SPI_I2SPSC_DIV) | (i2sof & SPI_I2SPSC_OF) | (i2s_mckout & SPI_I2SPSC_MCKOEN));

